utzig/incubator-mynewt-core/hw/usb/dev/hal/kinetis/src/kinetis_usb.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
/*
 * Copyright (c) 2015 - 2016, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <usb/usb.h>
#include <dev/dev.h>
#include <hal_usb/hal_usb.h>

#include <syscfg/syscfg.h>
#include <os/os.h>

#include <cmsis_nvic.h>

#include "fsl_device_registers.h"
#include "fsl_common.h"

#define USBx_ISTAT_USBRST         0x01
#define USBx_ISTAT_ERROR          0x02
#define USBx_ISTAT_SOFTOK         0x04
#define USBx_ISTAT_TOKDNE         0x08
#define USBx_ISTAT_SLEEP          0x10
#define USBx_ISTAT_RESUME         0x20
#define USBx_ISTAT_ATTACH         0x40
#define USBx_ISTAT_STALL          0x80

static __attribute__((aligned(512))) uint8_t bdt_buffer[512];

static uint8_t g_buf[8] = { 0 };

static kinetis_usb_dev_state_t g_kinetis_usb_dev_state;

#define DMA_ALIGN_LEN 64
static uint32_t g_kinetis_usb_dma_buffer[((DMA_ALIGN_LEN - 1) >> 2) + 1];

static void *g_handle = NULL;

static usb_status_t _kinetis_usb_send(usb_dev_ctrl_handle handle,
                 uint8_t ep_addr, uint8_t *buf, uint32_t len);
static usb_status_t _kinetis_usb_recv(usb_dev_ctrl_handle khciHandle,
                 uint8_t endpointAddress,
                 uint8_t *buffer,
                 uint32_t length);
static usb_status_t _kinetis_usb_cancel(usb_dev_ctrl_handle khciHandle,
                 uint8_t ep);
static usb_status_t _kinetis_usb_control(usb_dev_ctrl_handle handle,
                 usb_device_control_type_t type, void *param);

static uint32_t
_BDT_MEM(uint32_t base, uint32_t ep, uint32_t dir, uint32_t odd)
{
    uint32_t mem = base & 0xfffffe00;
    mem |= (ep & 0x0f) << 5;
    mem |= (dir & 1) << 4;
    mem |= (odd & 1) << 3;
    return mem;
}
static void
_BDT_SET_ADDR(uint32_t base, uint32_t ep, uint32_t dir, uint32_t odd, uint32_t addr)
{
    uint32_t mem = _BDT_MEM(base, ep, dir, odd);
    *((volatile uint32_t *) mem + 1) = addr;
}

static uint32_t
_BDT_GET_ADDR(uint32_t base, uint32_t ep, uint32_t dir, uint32_t odd)
{
    uint32_t mem = _BDT_MEM(base, ep, dir, odd);
    return *((volatile uint32_t *) mem + 1);
}

static void
_BDT_SET_CONTROL(uint32_t base, uint32_t ep, uint32_t dir, uint32_t odd, uint32_t control)
{
    uint32_t mem = _BDT_MEM(base, ep, dir, odd);
    *((volatile uint32_t *) mem) = control;
}

static uint32_t
_BDT_GET_CONTROL(uint32_t base, uint32_t ep, uint32_t dir, uint32_t odd)
{
    uint32_t mem = _BDT_MEM(base, ep, dir, odd);
    return *((volatile uint32_t *) mem);
}

static void
_init_cb_msg_with_code(usb_dev_cb_msg_t *msg, usb_device_notification_t code)
{
    msg->buf = NULL;
    msg->len = 0;
    msg->code = code;
    msg->isSetup = 0;
}

/*
 * Start a transfer by writing the BDT.
 */
static usb_status_t
_kinetis_usb_dev_ep_txfer(kinetis_usb_dev_state_t *state, uint8_t ep,
        uint8_t dir, uint8_t *buf, uint32_t len)
{
    uint8_t odd;
    uint8_t data0;
    uint32_t control;
    kinetis_usb_dev_ep_state_t *epstate = NULL;
    os_sr_t sr;

    OS_ENTER_CRITICAL(sr);

    epstate = &state->epstate[(ep << 1) | dir];
    epstate->u.bm.transferring = 1;
    odd = epstate->u.bm.odd;
    data0 = epstate->u.bm.data0;

    _BDT_SET_ADDR((uint32_t)state->bdt, ep, dir, odd, (uint32_t)buf);

    control = USB_LONG_TO_LITTLE_ENDIAN(USB_KHCI_BDT_BC(len) |
            USB_KHCI_BDT_OWN | USB_KHCI_BDT_DTS | USB_KHCI_BDT_DATA01(data0));
    _BDT_SET_CONTROL((uint32_t)state->bdt, ep, dir, odd, control);

    OS_EXIT_CRITICAL(sr);

    for (int i=0; i<8; i++) g_buf[i] = buf[i];

    state->registers->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
    return 0;
}

/*
 * This function is used to prime a buffer in control out pipe to wait for
 * receiving the host's setup packet.
 */
static void
_prime_next_setup(kinetis_usb_dev_state_t *state)
{
    kinetis_usb_dev_ep_state_t *epstate = &state->epstate[0];

