utzig/incubator-mynewt-core/hw/usb/dev/hal/kinetis/src/kinetis_usb.c
#if defined(FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED) && \
    defined(USB_DEVICE_CONFIG_KEEP_ALIVE_MODE) && \
    defined(FSL_FEATURE_USB_KHCI_USB_RAM)
    /* In case of lowpower mode enabled, it requires to put the setup packet buffer(16 bytes) into the USB RAM so
     * that the setup packet would wake up the USB.
     */
    epstate->xfer_buf = (uint8_t *)(state->bdt + 0x200 - 0x10) +
        epstate->u.bm.odd * USB_SETUP_PACKET_SIZE;
#else
    epstate->xfer_buf = (uint8_t *)&state->setupPacketBuffer[0] +
        epstate->u.bm.odd * USB_SETUP_PACKET_SIZE;
#endif

    epstate->xfer_done = 0;
    epstate->xfer_len = USB_SETUP_PACKET_SIZE;
    epstate->u.bm.dma_align = 1;
    epstate->u.bm.data0 = 0;

    _kinetis_usb_dev_ep_txfer(state, USB_CONTROL_ENDPOINT, USB_OUT,
                              epstate->xfer_buf, USB_SETUP_PACKET_SIZE);
}

static void
_kinetis_usb_dev_set_dflt(kinetis_usb_dev_state_t *state)
{
    uint8_t interruptFlag;
    int i;

    state->registers->ERRSTAT = 0xFF;

    /* Setting this bit to 1 resets all the BDT ODD ping/pong fields to 0,
     * which then specifies the EVEN BDT bank.
     */
    state->registers->CTL |= USB_CTL_ODDRST_MASK;

    state->registers->ADDR = 0;

    /* Clear the endpoint state and disable the endpoint */
    for (i = 0; i < MYNEWT_VAL(USB_DEVICE_CONFIG_ENDPOINTS); i++) {
        _BDT_SET_CONTROL((uint32_t)state->bdt, i, USB_OUT, 0, 0);
        _BDT_SET_CONTROL((uint32_t)state->bdt, i, USB_OUT, 1, 0);
        _BDT_SET_CONTROL((uint32_t)state->bdt, i, USB_IN, 0, 0);
        _BDT_SET_CONTROL((uint32_t)state->bdt, i, USB_IN, 1, 0);

        state->epstate[(i << 1) | USB_OUT].u.state = 0;
        state->epstate[(i << 1) | USB_IN].u.state = 0;
        state->registers->ENDPOINT[i].ENDPT = 0x00;
    }

    state->isDmaAlignBufferInusing = 0;
    state->registers->CTL &= ~USB_CTL_ODDRST_MASK;
    state->registers->ERREN = 0xFF;

    interruptFlag = USBx_ISTAT_USBRST | USBx_ISTAT_TOKDNE | USBx_ISTAT_STALL
#if 0
                    | USBx_ISTAT_SOFTOK
#endif
                    ;

#if MYNEWT_VAL(USB_KINETIS_LOW_POWER_MODE)
    interruptFlag |= USBx_ISTAT_SLEEP;
#endif

#if defined(USB_DEVICE_CONFIG_KHCI_ERROR_HANDLING)
    interruptFlag |= USBx_ISTAT_ERROR;
#endif

    state->registers->INTEN = interruptFlag;
    state->isResetting = 0;
    state->registers->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
}

static usb_status_t
_kinetis_usb_dev_ep_init(kinetis_usb_dev_state_t *state, usb_dev_ep_init_t *epInit)
{
    uint16_t maxPacketSize = epInit->maxPacketSize;
    uint8_t ep = USB_EP_NUMBER(epInit->endpointAddress);
    uint8_t dir = USB_EP_DIR(epInit->endpointAddress);
    kinetis_usb_dev_ep_state_t *epstate = NULL;

    epstate = &state->epstate[(ep << 1) | dir];

    /* Make the endpoint max packet size align with USB Specification 2.0. */
    if (epInit->transferType == USB_ENDPOINT_ISOCHRONOUS) {
        if (maxPacketSize > USB_DEVICE_MAX_FS_ISO_MAX_PACKET_SIZE) {
            maxPacketSize = USB_DEVICE_MAX_FS_ISO_MAX_PACKET_SIZE;
        }
    } else {
        if (maxPacketSize > USB_DEVICE_MAX_FS_NONE_ISO_MAX_PACKET_SIZE) {
            maxPacketSize = USB_DEVICE_MAX_FS_NONE_ISO_MAX_PACKET_SIZE;
        }
        /* Enable an endpoint to perform handshaking during a transaction to this endpoint. */
        state->registers->ENDPOINT[ep].ENDPT |= USB_ENDPT_EPHSHK_MASK;
    }

    epstate->u.bm.transferring = 0;
    epstate->u.bm.max_pkt_size = maxPacketSize;
    epstate->u.bm.data0 = 0;
    epstate->u.bm.stalled = 0;
    epstate->u.bm.zlt = epInit->zlt;
    state->registers->ENDPOINT[ep].ENDPT |= (dir == USB_IN) ?
        USB_ENDPT_EPTXEN_MASK : USB_ENDPT_EPRXEN_MASK;

    /* Prime a transfer to receive next setup packet when the endpoint is control out endpoint. */
    if (ep == 0 && dir == USB_OUT) {
        _prime_next_setup(state);
    }

    return 0;
}

static usb_status_t
_kinetis_usb_dev_ep_deinit(kinetis_usb_dev_state_t *state, uint8_t ep_addr)
{
    uint8_t ep = USB_EP_NUMBER(ep_addr);
    uint8_t dir = USB_EP_DIR(ep_addr);

    _kinetis_usb_cancel(state, ep_addr);

    state->registers->ENDPOINT[ep].ENDPT = 0x00;
    state->epstate[(ep << 1) | dir].u.bm.max_pkt_size = 0;

    return 0;
}

static usb_status_t
_kinetis_usb_dev_ep_stall(kinetis_usb_dev_state_t *state, uint8_t ep_addr)
{
    uint8_t ep = USB_EP_NUMBER(ep_addr);
    uint8_t dir = USB_EP_DIR(ep_addr);
    kinetis_usb_dev_ep_state_t *epstate = NULL;

    epstate = &state->epstate[(ep << 1) | dir];

    _kinetis_usb_cancel(state, ep_addr);

    epstate->u.bm.stalled = 1;

    /* Set endpoint stall in BDT. And then if the host send a IN/OUT transaction,
     * the device will response a STALL state.
     */
    _BDT_SET_CONTROL((uint32_t)state->bdt, ep, dir, epstate->u.bm.odd,
            USB_LONG_TO_LITTLE_ENDIAN((uint32_t)(
                    USB_KHCI_BDT_BC(epstate->u.bm.max_pkt_size) |
                    USB_KHCI_BDT_DTS | USB_KHCI_BDT_STALL | USB_KHCI_BDT_OWN)));

    state->registers->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;

    return 0;
}

static usb_status_t
_kinetis_usb_dev_ep_unstall(kinetis_usb_dev_state_t *state, uint8_t ep_addr)
{
    uint32_t control;
    uint8_t ep = USB_EP_NUMBER(ep_addr);
    uint8_t dir = USB_EP_DIR(ep_addr);
    kinetis_usb_dev_ep_state_t *epstate = NULL;

    epstate = &state->epstate[(ep << 1) | dir];

    //printf("unstall 0x%02x\n", ep_addr);
    epstate->u.bm.stalled = 0;
    epstate->u.bm.data0 = 0;

    /* Clear stall state in BDT */
    for (uint8_t i = 0; i < 2; i++) {
        control = _BDT_GET_CONTROL((uint32_t)state->bdt, ep, dir, i);
        if (control & USB_KHCI_BDT_STALL) {
            _BDT_SET_CONTROL((uint32_t)state->bdt, ep, dir, i,
                    USB_LONG_TO_LITTLE_ENDIAN((uint32_t)
                        (USB_KHCI_BDT_BC(epstate->u.bm.max_pkt_size) |
                         USB_KHCI_BDT_DTS | USB_KHCI_BDT_DATA01(0))));
        }
    }

    state->registers->ENDPOINT[ep].ENDPT &= ~USB_ENDPT_EPSTALL_MASK;

    if (ep == 0 && dir == USB_OUT) {
        _prime_next_setup(state);
    }

    state->registers->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;

