utzig/incubator-mynewt-core/hw/usb/dev/hal/kinetis/src/kinetis_usb.c
    return 0;
}

/*
 * Handle the token done interrupt.
 */
static void
_kinetis_usb_dev_tokdone(kinetis_usb_dev_state_t *state)
{
    uint32_t control;
    uint32_t len;
    uint32_t remlen;
    uint8_t *bdtBuffer;
    usb_dev_cb_msg_t msg;
    uint8_t ep;
    uint8_t dir;
    uint8_t odd;
    uint8_t setup;
    kinetis_usb_dev_ep_state_t *epstate = NULL;
    uint8_t stat = state->registers->STAT;

    ep = (stat & USB_STAT_ENDP_MASK) >> USB_STAT_ENDP_SHIFT;
    dir = (stat & USB_STAT_TX_MASK) >> USB_STAT_TX_SHIFT;
    odd = (stat & USB_STAT_ODD_MASK) >> USB_STAT_ODD_SHIFT;
    state->registers->ISTAT = USBx_ISTAT_TOKDNE;

    control = _BDT_GET_CONTROL((uint32_t)state->bdt, ep, dir, odd);

    bdtBuffer = (uint8_t *)_BDT_GET_ADDR((uint32_t)state->bdt, ep, dir, odd);

    len = ((USB_LONG_FROM_LITTLE_ENDIAN(control)) >> 16) & 0x3ff;

    setup = (USB_KHCI_BDT_DEVICE_SETUP_TOKEN ==
         ((uint8_t)(((USB_LONG_FROM_LITTLE_ENDIAN(control)) >> 2) & 0x0f))) ?
        1 : 0;

    epstate = &state->epstate[(ep << 1) | dir];

    if (!epstate->u.bm.transferring) {
        return;
    }

    if (setup) {
        state->setupBufferIndex = odd;
    }

    if (dir == USB_IN) {
        epstate->xfer_done += len;

        remlen = epstate->xfer_len - epstate->xfer_done;

        epstate->u.bm.data0 ^= 1;
        epstate->u.bm.odd ^= 1;

        /* Whether the transfer is completed or not. */
        /*
         * The transfer is completed when one of the following conditions meet:
         * 1. The remaining length is zero.
         * 2. The length of current transcation is less than the max packet size of the current pipe.
         */
        if (!remlen || epstate->u.bm.max_pkt_size > len) {
            msg.len = epstate->xfer_done;
            msg.buf = epstate->xfer_buf;
            epstate->u.bm.transferring = 0;

            /*
             * Whether need to send ZLT when the pipe is control in pipe and the transferred length of current
             * transaction equals to max packet size.
             */
            if (len && !(len % epstate->u.bm.max_pkt_size)) {
                if (ep == 0) {
                    usb_setup_struct_t *setup_packet = (usb_setup_struct_t *)
                        &state->setupPacketBuffer[
                         USB_SETUP_PACKET_SIZE * state->setupBufferIndex];
                    /*
                     * Send the ZLT and terminate the token done interrupt service when the tranferred length in data
                     * phase
                     * is less than the host request.
                     */
                    if (USB_SHORT_FROM_LITTLE_ENDIAN(setup_packet->wLength) >
                        epstate->xfer_len) {
                        (void)_kinetis_usb_dev_ep_txfer(state, ep, USB_IN, NULL, 0);
                        return;
                    }
                } else if (epstate->u.bm.zlt) {
                    (void)_kinetis_usb_dev_ep_txfer(state, ep, USB_IN, NULL, 0);
                    return;
                }
            }
        } else {
            _kinetis_usb_send(state, ep | 0x80, epstate->xfer_buf, remlen);
            return;
        }
    } else {
        if (ep == 0 && !len) {
            msg.len = 0;
            msg.buf = NULL;
        } else {
            if (!epstate->u.bm.dma_align) {
                uint8_t *buffer = (uint8_t *)USB_LONG_FROM_LITTLE_ENDIAN(
                    _BDT_GET_ADDR((uint32_t)state->bdt, ep, USB_OUT, epstate->u.bm.odd));
                uint8_t *transferBuffer = epstate->xfer_buf + epstate->xfer_done;
                if (buffer != transferBuffer) {
                    for (uint32_t i = 0; i < len; i++) {
                        transferBuffer[i] = buffer[i];
                    }
                }
                state->isDmaAlignBufferInusing = 0;
            }
            epstate->xfer_done += len;
            remlen = epstate->xfer_len - epstate->xfer_done;

            if (ep == 0 && setup) {
                state->epstate[0].u.bm.data0 = 1;
                state->epstate[1].u.bm.data0 = 1;
            } else {
                epstate->u.bm.data0 ^= 1;
            }
            epstate->u.bm.odd ^= 1;
            if (!epstate->xfer_len || !remlen || epstate->u.bm.max_pkt_size > len) {
                msg.len = epstate->xfer_done;
                msg.buf = setup ? bdtBuffer : epstate->xfer_buf;
                epstate->u.bm.transferring = 0;
            } else {
                _kinetis_usb_recv(state, ep, epstate->xfer_buf, remlen);
                return;
            }
        }
    }

    msg.isSetup = setup;
    msg.code = ep | (dir << 7);
    usb_dev_notify(state->dev, &msg);

    state->registers->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
}

static void
_kinetis_usb_dev_reset(kinetis_usb_dev_state_t *state)
{
    usb_dev_cb_msg_t msg;
    volatile USB_Type *regs = state->registers;

    state->isResetting = 1;
    regs->ISTAT = USBx_ISTAT_USBRST;

#if MYNEWT_VAL(USB_KINETIS_LOW_POWER_MODE)
    regs->ISTAT = USBx_ISTAT_SLEEP;
    regs->USBCTRL &= ~USB_USBCTRL_SUSP_MASK;
#endif

    _init_cb_msg_with_code(&msg, kUSB_DeviceNotifyBusReset);
    usb_dev_notify(state->dev, &msg);
}

/* The USB suspend and resume signals need to be detected and handled when the
 * low power or remote wakeup function enabled.
 */
#if MYNEWT_VAL(USB_KINETIS_LOW_POWER_MODE)
static void
_kinetis_usb_dev_sleep(kinetis_usb_dev_state_t *state)
{
    usb_dev_cb_msg_t msg;
    volatile USB_Type *regs = state->registers;

    regs->INTEN |= USBx_ISTAT_RESUME;
    regs->USBTRC0 |= USB_USBTRC0_USBRESMEN_MASK;
    regs->USBCTRL |= USB_USBCTRL_SUSP_MASK;

    regs->INTEN &= ~((uint32_t)USBx_ISTAT_SLEEP);

    regs->ISTAT = USBx_ISTAT_SLEEP;
    regs->ISTAT = USBx_ISTAT_RESUME;

    _init_cb_msg_with_code(&msg, kUSB_DeviceNotifySuspend);
    usb_dev_notify(state->deviceHandle, &msg);
}

static void
_kinetis_usb_dev_resume(kinetis_usb_dev_state_t *state)
{
    usb_dev_cb_msg_t msg;
    volatile USB_Type *regs = state->registers;

    regs->USBCTRL &= ~USB_USBCTRL_SUSP_MASK;
    regs->INTEN |= USBx_ISTAT_SLEEP;
    regs->INTEN &= ~((uint32_t)USBx_ISTAT_RESUME);
    regs->USBTRC0 &= ~USB_USBTRC0_USBRESMEN_MASK;

    regs->ISTAT = USBx_ISTAT_RESUME;
    regs->ISTAT = USBx_ISTAT_SLEEP;

    _init_cb_msg_with_code(&msg, kUSB_DeviceNotifyResume);
    usb_dev_notify(state->deviceHandle, &msg);
}
#endif /* USB_KINETIS_LOW_POWER_MODE */

#if defined(USB_DEVICE_CONFIG_DETACH_ENABLE) && \
    defined(FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED)
static void
_kinetis_usb_dev_vbus_rising(kinetis_usb_dev_state_t *state)
{
    usb_dev_cb_msg_t msg;
    volatile USB_Type *regs = state->regs;

    regs->MISCCTRL &= ~USB_MISCCTRL_VREDG_EN_MASK;
    regs->MISCCTRL |= USB_MISCCTRL_VREDG_EN_MASK;

    _init_cb_msg_with_code(&msg, kUSB_DeviceNotifyAttach);
    usb_dev_notify(state->deviceHandle, &msg);
}

static void
_kinetis_usb_dev_vbus_falling(kinetis_usb_dev_state_t *state)
{
    usb_dev_cb_msg_t msg;

    state->registers->MISCCTRL &= ~USB_MISCCTRL_VFEDG_EN_MASK;
    state->registers->MISCCTRL |= USB_MISCCTRL_VFEDG_EN_MASK;

