utzig/incubator-mynewt-core/hw/usb/dev/hal/kinetis/src/kinetis_usb.c
    _init_cb_msg_with_code(&msg, kUSB_DeviceNotifyDetach);
    usb_dev_notify(state->deviceHandle, &msg);
}
#endif /* USB_DEVICE_CONFIG_DETACH_ENABLE || FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED */

#if 0
void
kinetis_usb_dev_sof(kinetis_usb_dev_state_t *state)
{
    state->registers->ISTAT = USBx_ISTAT_SOFTOK;
    state->registers->ISTAT = USBx_ISTAT_RESUME;
}
#endif

static void
_kinetis_usb_dev_stall(kinetis_usb_dev_state_t *state)
{
    while (state->registers->ISTAT & USBx_ISTAT_STALL) {
        state->registers->ISTAT = USBx_ISTAT_STALL;
    }

    /* Un-stall the control in and out pipe when the control in or out pipe stalled. */
    if (state->epstate[0x80].u.bm.stalled || state->epstate[0].u.bm.stalled) {
        _kinetis_usb_dev_ep_unstall(state, 0x80);
        _kinetis_usb_dev_ep_unstall(state, 0);
    }
}

#if defined(USB_DEVICE_CONFIG_KHCI_ERROR_HANDLING)
static void
_kinetis_usb_dev_error(kinetis_usb_dev_state_t *state)
{
    usb_dev_cb_msg_t msg;

    state->registers->ISTAT = USBx_ISTAT_ERROR;

    _init_cb_msg_with_code(&msg, kUSB_DeviceNotifyError);
    usb_dev_notify(state->deviceHandle, &msg);
}
#endif

/*
 * @param controllerId An ID to identify the USB dev supporting multiple
 *                     peripherals.
 * @param handle       TODO
 * @param ctrl_handle  The controller handle is provided back to caller.
 */
static usb_status_t
_kinetis_usb_init(uint8_t controllerId,
                  usb_device_handle handle,
                  usb_dev_ctrl_handle *ctrl_handle)
{
    kinetis_usb_dev_state_t *state;
    volatile USB_Type *regs;

    state = &g_kinetis_usb_dev_state;
    state->controllerId = controllerId;

    state->registers = (volatile USB_Type *) USB0_BASE;
    regs = state->registers;

    state->dmaAlignBuffer = (uint8_t *) &g_kinetis_usb_dma_buffer[0];

    regs->ISTAT = 0xff;

#if defined(USB_DEVICE_CONFIG_OTG)
    state->otgStatus = 0;
#else
    _kinetis_usb_control(state, USB_DEV_CTRL_STOP, NULL);
#endif

    state->bdt = bdt_buffer;

    regs->BDTPAGE1 = (((uint32_t)state->bdt) >> 8) & 0xFF;
    regs->BDTPAGE2 = (((uint32_t)state->bdt) >> 16) & 0xFF;
    regs->BDTPAGE3 = (((uint32_t)state->bdt) >> 24) & 0xFF;

#if defined(USB_DEVICE_CONFIG_DETACH_ENABLE) && \
    defined(FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED)
    regs->MISCCTRL |= USB_MISCCTRL_VREDG_EN_MASK | USB_MISCCTRL_VFEDG_EN_MASK;
#endif

#if defined(FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED) && \
    defined(USB_DEVICE_CONFIG_KEEP_ALIVE_MODE) && \
    defined(FSL_FEATURE_USB_KHCI_USB_RAM)
    regs->CLK_RECOVER_CTRL |= USB_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN_MASK;
    regs->KEEP_ALIVE_CTRL =
        USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_MASK |
        USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_MASK |
        USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_MASK |
        FSL_FEATURE_USB_KHCI_KEEP_ALIVE_MODE_CONTROL;
    regs->KEEP_ALIVE_WKCTRL = 1;
    PMC->REGSC |= PMC_REGSC_BGEN_MASK | PMC_REGSC_VLPO_MASK;
#endif

    _kinetis_usb_dev_set_dflt(state);

    *ctrl_handle = state;
    state->dev = (usb_dev_t *)handle;

    return 0;
}

static usb_status_t
_kinetis_usb_deinit(usb_dev_ctrl_handle handle)
{
    volatile USB_Type *regs = NULL;

    if (!handle) {
        return kStatus_USB_InvalidHandle;
    }

    regs = ((kinetis_usb_dev_state_t *) handle)->registers;

    regs->ISTAT = 0xFF;
    regs->INTEN &= ~0xFF;
    regs->ADDR = 0;
    regs->CTL = 0x00;
    regs->USBCTRL |= USB_USBCTRL_PDE_MASK | USB_USBCTRL_SUSP_MASK;

    return 0;
}

/*!
 * @brief Send data through a specified endpoint.
 *
 * This function sends data through a specified endpoint.
 *
 * @note The return value just means if the sending request is successful or not; the transfer done is notified by the
 * corresponding callback function.
 * Currently, only one transfer request can be supported for one specific endpoint.
 * If there is a specific requirement to support multiple transfer requests for one specific endpoint, the application
 * should implement a queue in the application level.
 * The subsequent transfer could begin only when the previous transfer is done (get notification through the endpoint
 * callback).
 */
static usb_status_t
_kinetis_usb_send(usb_dev_ctrl_handle handle, uint8_t ep_addr, uint8_t *buf, uint32_t len)
{
    kinetis_usb_dev_state_t *state = (kinetis_usb_dev_state_t *)handle;
    kinetis_usb_dev_ep_state_t *epstate = NULL;
    usb_status_t err = kStatus_USB_Error;

    epstate = &state->epstate[(USB_EP_NUMBER(ep_addr) << 1) | USB_IN];

    if (!epstate->u.bm.transferring) {
        epstate->xfer_done = 0;
        epstate->xfer_buf = buf;
        epstate->xfer_len = len;
        epstate->u.bm.dma_align = 1;
    }

    if (len > epstate->u.bm.max_pkt_size) {
        len = epstate->u.bm.max_pkt_size;
    }

    if (g_buf[1] != 0) {
        printf("-> ");
        for (int i=0; i<8; i++) printf("[%02x]", g_buf[i]);
        printf(" \n");
        for (int i=0; i<8; i++) g_buf[i]=0;
    }

    if (!state->isResetting) {
        //printf("_kinetis_usb_send, ep=%d len=%d\n", ep_addr, len);
        err = _kinetis_usb_dev_ep_txfer(state, USB_EP_NUMBER(ep_addr), USB_IN,
            (uint8_t *)(epstate->xfer_buf + epstate->xfer_done), len);
    }

    if (!epstate->xfer_done && !len && USB_EP_NUMBER(ep_addr) == 0) {
        _prime_next_setup(state);
    }
    return err;
}

/*!
 * This function Receives data through a specified endpoint.
 *
 * @note The return value just means if the receiving request is successful or
 * not; the transfer done is notified by the corresponding callback function.
 * Currently, only one transfer request can be supported for one specific endpoint.
 * If there is a specific requirement to support multiple transfer requests for
 * one specific endpoint, the application should implement a queue in the
 * application level. The subsequent transfer could begin only when the previous
 * transfer is done (get notification through the endpoint callback).
 */
static usb_status_t
_kinetis_usb_recv(usb_dev_ctrl_handle handle, uint8_t ep, uint8_t *buf, uint32_t len)
{
    kinetis_usb_dev_state_t *state = (kinetis_usb_dev_state_t *)handle;
    kinetis_usb_dev_ep_state_t *epstate = NULL;
    usb_status_t err = kStatus_USB_Error;

    epstate = &state->epstate[USB_EP_NUMBER(ep) << 1];

    if (!len && USB_EP_NUMBER(ep) == 0) {
        epstate->u.bm.transferring = 0;
        _prime_next_setup(state);
    } else {
        if (!epstate->u.bm.transferring) {
            epstate->xfer_done = 0;
            epstate->xfer_buf = buf;
            epstate->xfer_len = len;
        }
        epstate->u.bm.dma_align = 1;

        if (len > epstate->u.bm.max_pkt_size) {
            len = epstate->u.bm.max_pkt_size;
        }

        buf = (uint8_t *)((uint32_t)buf + epstate->xfer_done);

        if (state->dmaAlignBuffer && !state->isDmaAlignBufferInusing &&
            len <= DMA_ALIGN_LEN && ((len & 3) || (((uint32_t)buf) & 3))) {
            epstate->u.bm.dma_align = 0;
            buf = state->dmaAlignBuffer;
            state->isDmaAlignBufferInusing = 1;
        }

        if (!state->isResetting) {
            //printf("_kinetis_usb_recv, ep=%d len=%d\n", ep, len);
            err = _kinetis_usb_dev_ep_txfer(state, USB_EP_NUMBER(ep), USB_OUT,
                                            buf, len);
        }
    }
    return err;
}

