utzig/incubator-mynewt-core/hw/usb/dev/hal/kinetis/src/kinetis_usb.c
static usb_status_t
_kinetis_usb_cancel(usb_dev_ctrl_handle handle, uint8_t ep)
{
    kinetis_usb_dev_state_t *state = (kinetis_usb_dev_state_t *)handle;
    usb_dev_cb_msg_t msg;
    kinetis_usb_dev_ep_state_t *epstate = NULL;

    epstate = &state->epstate[(USB_EP_NUMBER(ep) << 1) | USB_EP_DIR(ep)];

    /* Cancel the transfer and notify the up layer when the endpoint is busy. */
    if (epstate->u.bm.transferring) {
        msg.len = USB_UNINITIALIZED_VAL_32;
        msg.buf = epstate->xfer_buf;
        msg.code = ep;
        msg.isSetup = 0;
        epstate->u.bm.transferring = 0;
        usb_dev_notify(state->dev, &msg);
    }
    return 0;
}

static usb_status_t
_kinetis_usb_control(usb_dev_ctrl_handle handle,
                     usb_device_control_type_t type, void *param)
{
    kinetis_usb_dev_state_t *state = NULL;
    volatile USB_Type *regs = NULL;
#if MYNEWT_VAL(USB_DEVICE_CONFIG_REMOTE_WAKEUP)
    usb_dev_t *dev;
    uint64_t startTick;
#endif
    usb_status_t err = kStatus_USB_Error;

    if (!handle) {
        return kStatus_USB_InvalidHandle;
    }

    state = (kinetis_usb_dev_state_t *) handle;
    regs = state->registers;

#if MYNEWT_VAL(USB_DEVICE_CONFIG_REMOTE_WAKEUP)
    dev = (usb_dev_t *) state->dev;
#endif

#if 0
    if (g_buf[1] != 0) {
        printf("-> ");
        for (int i=0; i<8; i++) printf("[%02x]", g_buf[i]);
        printf(" \n");
        for (int i=0; i<8; i++) g_buf[i]=0;
    }
#endif

    switch (type) {
    case USB_DEV_CTRL_RUN:
        regs->USBCTRL = 0;
#if MYNEWT_VAL(FSL_FEATURE_USB_KHCI_OTG_ENABLED)
        if (regs->OTGCTL & USB_OTGCTL_OTGEN_MASK) {
            regs->OTGCTL |= USB_OTGCTL_DPHIGH_MASK;
        }
#endif
        regs->CONTROL |= USB_CONTROL_DPPULLUPNONOTG_MASK;
        regs->CTL |= USB_CTL_USBENSOFEN_MASK;
        err = 0;
        break;
    case USB_DEV_CTRL_STOP:
#if MYNEWT_VAL(FSL_FEATURE_USB_KHCI_OTG_ENABLED)
        if (regs->OTGCTL & USB_OTGCTL_OTGEN_MASK) {
            regs->OTGCTL &= ~USB_OTGCTL_DPHIGH_MASK;
        }
#endif
        regs->CONTROL &= ~USB_CONTROL_DPPULLUPNONOTG_MASK;
        err = 0;
        break;
    case USB_DEV_CTRL_EP_INIT:
        if (param) {
            err = _kinetis_usb_dev_ep_init(state, (usb_dev_ep_init_t *) param);
        }
        break;
    case USB_DEV_CTRL_EP_DEINIT:
        if (param) {
            err = _kinetis_usb_dev_ep_deinit(state, *((uint8_t *) param));
        }
        break;
    case USB_DEV_CTRL_EP_STALL:
        if (param) {
            err = _kinetis_usb_dev_ep_stall(state, *((uint8_t *) param));
        }
        break;
    case USB_DEV_CTRL_EP_UNSTALL:
        if (param) {
            err = _kinetis_usb_dev_ep_unstall(state, *((uint8_t *) param));
        }
        break;
    case USB_DEV_CTRL_GET_STATUS:
        if (param) {
            *((uint16_t *) param) =
                (MYNEWT_VAL(USB_DEVICE_CONFIG_SELF_POWER) <<
                 (USB_REQ_STD_GET_STATUS_DEVICE_SELF_POWERED_SHIFT))
#if MYNEWT_VAL(USB_DEVICE_CONFIG_REMOTE_WAKEUP)
                | ((uint16_t)(((uint32_t)devhandle->remotewakeup)
                            << USB_REQ_STD_GET_STATUS_DEVICE_REMOTE_WARKUP_SHIFT))
#endif
            ;
            err = 0;
        }
        break;
    case USB_DEV_CTRL_GET_EP_STATUS:
        if (param) {
            usb_dev_ep_status_t *ep_status = (usb_dev_ep_status_t *)param;

            if (USB_EP_NUMBER(ep_status->addr) < MYNEWT_VAL(USB_DEVICE_CONFIG_ENDPOINTS)) {
                ep_status->status = (uint16_t)(
                    state->epstate[
                        (USB_EP_NUMBER(ep_status->addr) << 1) | USB_EP_DIR(ep_status->addr)]
                        .u.bm.stalled == 1) ?
                    kUSB_DeviceEndpointStateStalled :
                    kUSB_DeviceEndpointStateIdle;
                err = 0;
            }
        }
        break;
    case USB_DEV_CTRL_SET_ADDR:
        if (param) {
            regs->ADDR = *((uint8_t *)param);
            err = 0;
        }
        break;
    case USB_DEV_CTRL_GET_SYNCF:
        break;
#if MYNEWT_VAL(USB_KINETIS_LOW_POWER_MODE)
#if MYNEWT_VAL(USB_DEVICE_CONFIG_REMOTE_WAKEUP)
    case USB_DEV_CTRL_RESUME:
        regs->CTL |= USB_CTL_RESUME_MASK;
        startTick = devhandle->hwTick;
        while ((devhandle->hwTick - startTick) < 10) {
            __ASM("nop");
        }
        regs->CTL &= ~USB_CTL_RESUME_MASK;
        err = 0;
        break;
#endif /* USB_DEVICE_CONFIG_REMOTE_WAKEUP */
    case USB_DEV_CTRL_SUSPEND:
        err = 0;
        break;
#endif /* USB_KINETIS_LOW_POWER_MODE */
    case USB_DEV_CTRL_SET_DFLT_STATUS:
        for (uint8_t count = 0; count < MYNEWT_VAL(USB_DEVICE_CONFIG_ENDPOINTS); count++) {
            _kinetis_usb_dev_ep_deinit(state, count | 0x80);
            _kinetis_usb_dev_ep_deinit(state, count);
        }
        _kinetis_usb_dev_set_dflt(state);
        err = 0;
        break;
    case USB_DEV_CTRL_GET_SPEED:
        if (param) {
            *((uint8_t *)param) = USB_SPEED_FULL;
            err = 0;
        }
        break;
#if MYNEWT_VAL(USB_DEVICE_CONFIG_OTG)
    case USB_DEV_CTRL_GET_OTG_STATUS:
        *((uint8_t *)param) = state->otgStatus;
        break;
    case USB_DEV_CTRL_SET_OTG_STATUS:
        state->otgStatus = *((uint8_t *)param);
        break;
#endif
    default:
        break;
    }

    return err;
}

/*!
 * The function is used to handle the KHCI device interrupt.
 *
 * @param deviceHandle    The device handle got from USB_DeviceInit.
 */
static void
kinetis_usb_dev_isr(void)
{
    usb_dev_t *dev = (usb_dev_t *) g_handle;
    kinetis_usb_dev_state_t *state;
    volatile USB_Type *regs = NULL;
    uint8_t status;

    if (!dev) {
        return;
    }

    state = (kinetis_usb_dev_state_t *) dev->ctrl_handle;
    regs = state->registers;

    status = regs->ISTAT;

#if defined(FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED) && \
    defined(USB_DEVICE_CONFIG_KEEP_ALIVE_MODE) && \
    defined(FSL_FEATURE_USB_KHCI_USB_RAM)
    if (regs->KEEP_ALIVE_CTRL & USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_MASK) {
        regs->KEEP_ALIVE_CTRL |= USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_MASK;
    }
    if (regs->ISTAT & USB_ISTAT_SOFTOK_MASK) {
        regs->ISTAT = USB_ISTAT_SOFTOK_MASK;
    }
#endif

#if defined(USB_DEVICE_CONFIG_KHCI_ERROR_HANDLING)
    if (status & USBx_ISTAT_ERROR) {
        _kinetis_usb_dev_error(state);
    }
#endif

    if (status & USBx_ISTAT_TOKDNE) {
        _kinetis_usb_dev_tokdone(state);
    }

    if (status & USBx_ISTAT_USBRST) {
        _kinetis_usb_dev_reset(state);
    }

#if MYNEWT_VAL(USB_KINETIS_LOW_POWER_MODE)
    if (status & USBx_ISTAT_SLEEP) {
        _kinetis_usb_dev_sleep(state);
    }

