utzig/incubator-mynewt-core/hw/usb/dev/hal/kinetis/src/kinetis_usb.c
    if (status & USBx_ISTAT_RESUME) {
        _kinetis_usb_dev_resume(state);
    }

    if (regs->USBTRC0 & USB_USBTRC0_USB_RESUME_INT_MASK) {
        _kinetis_usb_dev_resume(state);
    }
#endif

    if (status & USBx_ISTAT_STALL) {
        _kinetis_usb_dev_stall(state);
    }

#if defined(USB_DEVICE_CONFIG_DETACH_ENABLE) && \
    defined(FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED)
    if (regs->USBTRC0 & USB_USBTRC0_VREDG_DET_MASK) {
        _kinetis_usb_dev_vbus_rising(state);
    }

    if (regs->USBTRC0 & USB_USBTRC0_VFEDG_DET_MASK) {
        _kinetis_usb_dev_vbus_falling(state);
    }
#endif

#if 0
    if (status & USBx_ISTAT_SOFTOK) {
        kinetis_usb_dev_sof(state);
    }
#endif

#if defined(FSL_FEATURE_USB_KHCI_IRC48M_MODULE_CLOCK_ENABLED)
    status = regs->CLK_RECOVER_INT_STATUS;
    if (status) {
        /* USB RECOVER interrupt is happenned */
        if (status & USB_CLK_RECOVER_INT_STATUS_OVF_ERROR_MASK) {
            /* Indicates that the USB clock recovery algorithm has detected
             * that the frequency trim adjustment needed for the IRC48M output
             * clock is outside the available TRIM_FINE adjustment range for
             * the IRC48M module.
             */
        }
        regs->CLK_RECOVER_INT_STATUS = status;
    }
#endif
}

static const usb_dev_ctrl_itf_t kinetis_interface = {
    _kinetis_usb_init,
    _kinetis_usb_deinit,
    _kinetis_usb_send,
    _kinetis_usb_recv,
    _kinetis_usb_cancel,
    _kinetis_usb_control,
};

usb_status_t
USB_DeviceErrorNotification(usb_dev_t *dev, usb_dev_cb_msg_t *msg)
{
    return dev->devcb(dev, kUSB_DeviceEventError, NULL);
}

void
usb_hal_init_clocks(void)
{
    CLOCK_EnableUsbfs0Clock(kCLOCK_UsbSrcIrc48M, 48000000);
}

const usb_dev_ctrl_itf_t *
usb_hal_controller_interface(void)
{
    return &kinetis_interface;
}

void
usb_hal_set_dev_handle(void *handle)
{
    g_handle = handle;
}

void
usb_hal_enable_irq(void)
{
    /* FIXME: make interrupt priority configurable */
    NVIC_SetPriority(USB0_IRQn, 3);
    NVIC_SetVector(USB0_IRQn, (uint32_t)kinetis_usb_dev_isr);
    NVIC_EnableIRQ(USB0_IRQn);
}

void
usb_hal_clear_memory(void)
{
    /* Not needed for kinetis */
}
